In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
import seaborn as sns

In [3]:
tip = sns.load_dataset("tips")

In [4]:
tip['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [6]:
tip['day'].value_counts(sort=False)

Thur    62
Fri     19
Sat     87
Sun     76
Name: day, dtype: int64

In [7]:
tip['day'].value_counts(dropna=True)

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [8]:
tip['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [11]:
df = sns.load_dataset("titanic")

In [12]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [15]:
df['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [17]:
df[(df['alive'] == "yes") & (df['class'] == "Second")].count()

survived       87
pclass         87
sex            87
age            83
sibsp          87
parch          87
fare           87
embarked       87
class          87
who            87
adult_male     87
deck           13
embark_town    87
alive          87
alone          87
dtype: int64

In [31]:
df[df.adult_male == False].sex.value_counts(dropna=True)

female    314
male       40
Name: sex, dtype: int64

In [35]:
df[df.age < 16].sex.value_counts(dropna=False)

female    43
male      40
Name: sex, dtype: int64

In [22]:
df['adult_male'].value_counts()

True     537
False    354
Name: adult_male, dtype: int64

In [26]:
df[df['age'] > 18]['sex'].value_counts()

male      382
female    193
Name: sex, dtype: int64

In [38]:
df['age'].value_counts(dropna=False)

NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
66.00      1
23.50      1
0.42       1
Name: age, Length: 89, dtype: int64

In [39]:
df['age'].min()

0.42

In [40]:
df['age'].max()

80.0

In [45]:
ages = []
count = []
for i in range(1, 82, 10):
    ages.append((i, i+10))
    
print(ages)

[(1, 11), (11, 21), (21, 31), (31, 41), (41, 51), (51, 61), (61, 71), (71, 81), (81, 91)]

In [56]:
df[(df['age']<11) & (df['age']>=1) & (df['alive'] == "no")].__len__()

26

###### Range of age starting from 5 and taking step of 10 ( 5-15 , 15-25 , 25-35 , 35-45 , 45-55 , 55-65 ) which has max death rate (i.e alive = 'no').

In [65]:
temp = {}
for i in range(1, 81, 10):
    c = df[(df['age']<(i+10)) & (df['age']>=i) & (df['alive'] == "no")].__len__()
    temp[(i, i+10)] = c
for key, value in temp.items():
    print(key, "---> ", value)

(1, 11) --->  26
(11, 21) --->  72
(21, 31) --->  147
(31, 41) --->  86
(41, 51) --->  51
(51, 61) --->  25
(61, 71) --->  14
(71, 81) --->  3

##### On the basis of sex who paid maximum fare

In [68]:
df.groupby("sex")['fare'].count()

sex
female    314
male      577
Name: fare, dtype: int64

In [69]:
df.groupby("sex")['fare'].sum()

sex
female    13966.6628
male      14727.2865
Name: fare, dtype: float64

In [70]:
df['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [72]:
df[:5]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [103]:
### What is Range of age who survived the most based on their class?

In [88]:
df[df['alive'] == "yes"].groupby("class")['age'].value_counts().index

MultiIndex([('First', 35.0),
            ('First', 36.0),
            ('First', 24.0),
            ('First', 30.0),
            ('First', 48.0),
            ('First', 22.0),
            ('First', 38.0),
            ('First', 39.0),
            ('First', 49.0),
            ('First', 16.0),
            ...
            ('Third', 17.0),
            ('Third', 23.0),
            ('Third', 33.0),
            ('Third', 35.0),
            ('Third', 36.0),
            ('Third', 38.0),
            ('Third', 39.0),
            ('Third', 44.0),
            ('Third', 45.0),
            ('Third', 63.0)],
           names=['class', 'age'], length=125)

In [91]:
for i in df['class'].unique():
    print(i)

Third
First
Second

In [102]:
temp = {}
for cls in df['class'].unique():
    d = {}
    for i in range(1, 81, 10): 
        c = df[(df['age']<(i+10)) & (df['age']>=i) & (df['alive'] == "yes") & (df['class'] == cls)].__len__()
        d[(i, i+10)] = c
    temp[cls] = d
for key, value in temp.items():
    print(f"{key}".center(80, "*"))
    for k, v in value.items():
        print(f"{k} --> {v}".center(80))
    #print(key, "---> ", value)

*************************************Third**************************************
                                 (1, 11) --> 16
                                (11, 21) --> 20
                                (21, 31) --> 30
                                (31, 41) --> 13
                                 (41, 51) --> 2
                                 (51, 61) --> 0
                                 (61, 71) --> 1
                                 (71, 81) --> 0
*************************************First**************************************
                                 (1, 11) --> 1
                                (11, 21) --> 15
                                (21, 31) --> 29
                                (31, 41) --> 37
                                (41, 51) --> 21
                                (51, 61) --> 15
                                 (61, 71) --> 2
                                 (71, 81) --> 1
*************************************Second*************************************
                                 (1, 11) --> 14
                                 (11, 21) --> 9
                                (21, 31) --> 25
                                (31, 41) --> 19
                                (41, 51) --> 10
                                 (51, 61) --> 2
                                 (61, 71) --> 1
                                 (71, 81) --> 0

In [100]:
temp

{'Third': {(1, 11): 16,
  (11, 21): 20,
  (21, 31): 30,
  (31, 41): 13,
  (41, 51): 2,
  (51, 61): 0,
  (61, 71): 1,
  (71, 81): 0},
 'First': {(1, 11): 1,
  (11, 21): 15,
  (21, 31): 29,
  (31, 41): 37,
  (41, 51): 21,
  (51, 61): 15,
  (61, 71): 2,
  (71, 81): 1},
 'Second': {(1, 11): 14,
  (11, 21): 9,
  (21, 31): 25,
  (31, 41): 19,
  (41, 51): 10,
  (51, 61): 2,
  (61, 71): 1,
  (71, 81): 0}}

In [104]:
### {"first" : {(1, 11) : 4 , (11, 21) : 5,.....}}

In [105]:
#### proportion of alive women to total women who boarded the ship VS same ratio for men

In [119]:
df[(df['sex'] == "female")].__len__()

314

In [115]:
df[(df['sex'] == "female") & (df['alive'] == "yes")].__len__() / (df['sex'] == "female").sum()

0.7420382165605095

In [114]:
df['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [120]:
df[(df['sex'] == "male") & (df['alive'] == "yes")].__len__() / (df['sex'] == "male").sum()

0.18890814558058924

In [121]:
(df['sex'] == "male").sum()

577

In [122]:
df[(df['sex'] == "male") & (df['alive'] == "yes")].__len__()

109

In [123]:
## What is percentage of survival based on their place of embark?

In [129]:
df.shape

(891, 15)

In [130]:
df.groupby("embarked")['survived'].value_counts() / 819

embarked  survived
C         1           0.113553
          0           0.091575
Q         0           0.057387
          1           0.036630
S         0           0.521368
          1           0.264957
Name: survived, dtype: float64

In [144]:
v = df.groupby("embarked")['survived'].value_counts().values
ind = df.groupby("embarked")['survived'].value_counts().index

In [145]:
ind

MultiIndex([('C', 1),
            ('C', 0),
            ('Q', 0),
            ('Q', 1),
            ('S', 0),
            ('S', 1)],
           names=['embarked', 'survived'])

In [146]:
len(ind)

6

In [143]:
len(v)

6

In [148]:
total = {}
for i in range(0, len(v), 2):
    t = v[i] + v[i+1]
    print(ind[i], "--> ", (v[i]/t)*100)
    print(ind[i+1], "--> ", (v[i+1]/t)*100)

('C', 1) -->  55.35714285714286
('C', 0) -->  44.642857142857146
('Q', 0) -->  61.038961038961034
('Q', 1) -->  38.961038961038966
('S', 0) -->  66.30434782608695
('S', 1) -->  33.69565217391305